{
    "name": "Luke Jodice",
    "email": "jodiceluke@gmail.com",
    "linkedin": "www.linkedin.com/in/luke-jodice/",
    "phone": "(508)360-7341",
    "title": "Software Developer - Software Engineer - IT Technician",
    "education": [
        {
            "school": "Endicott College, Beverly, MA",
            "degree": "Bachelor of Science in Computer Science",
            "honors": "GPA 3.41 Dean’s List",
            "activities": [
                "Computer Science Club",
                "Gaming Gulls(Gaming Club) President"
            ],
            "professional_society": "Society of Women Engineers",
            "achievements": [
                "1st place in Hackathon - ALive: Video Recorder ( React Native) featured in Boston Globe, BostonInno, and Endicott Website"
            ]
        }
    ],
    "projects": [
        {
            "name": "Risk of Rain 2 Database",
            "description": "A visual application designed to provide comprehensive information about characters, items, and enemies featured in the popular Hopoo Games title, Risk of Rain 2.",
            "technologies": [
                "Java"
            ]
        },
        {
            "name": "Dashboard Application",
            "description": "An efficient productivity tool incorporating customizable widgets.",
            "technologies": [
                "Java"
            ]
        },
        {
            "name": "CrowdWatch - Senior Thesis Project",
            "description": "A sophisticated tool aimed at enhancing the internal infrastructure of businesses by optimizing staffing and providing customers with real-time insights into business popularity.",
            "technologies": [
                "Python",
                "HTML",
                "CSS",
                "JavaScript (Vanilla/Node.js)",
                "Arduino"
            ]
        },
        {
            "name": "Musify",
            "description": "This ambitious project endeavors to recreate the web application experience of Spotify, meticulously replicating its design and features while enabling users to personalize their application experience.",
            "technologies": [
                "Next.Js",
                "React",
                "Stripe",
                "Supabase",
                "PostgreSQL",
                "Tailwind"
            ]
        }
    ],
    "technical_skills": {
        "development": [
            "Java",
            "Python",
            "JavaScript",
            "C++",
            ".Net",
            "Ardino",
            "Lua",
            "Bash"
        ],
        "web_technologies": [
            "HTML",
            "CSS",
            "React",
            "Node.js",
            "Tailwind",
            "Next.js"
        ],
        "communication_collaboration": [
            "Microsoft Teams",
            "Slack"
        ],
        "hosting_vc": [
            "Git/Github",
            "Firebase",
            "Supabase",
            "PostgreSQL"
        ],
        "project_management": [
            "Jira",
            "Trello"
        ],
        "writing": [
            "Microsoft Suite",
            "Google Workspace",
            "Markdown"
        ],
        "workstyles": [
            "Agile(Scrum)",
            "Agile(Kanban)"
        ]
    },
    "experience": [
        {
            "position": "Freelance Software Developer",
            "company": "JodiceSolutions (Chatham, MA - Remote)",
            "date": "May 2023 - Current",
            "key_parts_of_job": [
                "Web Development",
                "Scripting",
                "Documentation",
                "Client Communication"
            ],
            "job_responsibilities": [
                "Proficiently designed and developed user-friendly websites and software applications utilizing HTML, CSS, JavaScript, and modern frameworks.",
                "Skillfully employed Bash and Python scripting to implement automated solutions for administrative processes."
            ]
        },
        {
            "position": "Impact and Learning Fellow",
            "company": "YouthBuild USA, Roxbury MA",
            "date": "September 2022 - December 2022",
            "key_parts_of_job": [
                "Data Lifecycle Management",
                "Trello",
                "Slack"
            ],
            "job_responsibilities": [
                "Creation of a report template that will be shared with affiliate programs for their own use in fundraising, promotion of impact, and also drive accountability for the data and information they share with the organization",
                "information from the network of YouthBuild programs",
                "Support the development and implementation of a standard Customer Feedback survey to be distributed and used by Technical Assistance teams",
                " Develop summary reports of survey responses to be shared/discussed by TA teams",
                "Work with field services teams to review and support data-clean up and accuracy of data entered into the system."
            ]
        },
        {
            "position": "COO/Co-Founder",
            "company": "Sello.inc , Dennis, MA",
            "date": "January 2022 - October 2022",
            "key_parts_of_job": [
                "Software Development",
                "Documentation",
                "Communication",
                "Reporting"
            ],
            "job_responsibilities": [
                "Spearheaded and oversaw all company operations, encompassing frontend, backend, and financial teams, ensuring seamless coordination and efficiency",
                "Prepared and delivered comprehensive reports to the Chief Executive Officer, providing critical insights for informed decision-making",
                "Devised and executed strategies, procedures, and business plans to drive company growth, while leading Scrum meetings on a frequent basis",
                "Demonstrated expertise in mobile application development, harnessing the power of JavaScript and React Native to create cutting-edge solutions"
            ]
        },
        {
            "position": "Frontend Developer",
            "company": "Jenzabar.inc, Boston, MA",
            "date": "June 2021 - July 2021",
            "key_parts_of_job": [
                "Website Programming",
                "Data Coalessence",
                "Microsoft Teams"
            ],
            "job_responsibilities": [
                "Constructed portlets for Endicott College's higher-education management software to inform faculty about the new DEI graduation requirements",
                "Developed a webpage using frontend technologies (HTML/CSS/Javascript) that would display general electives that fulfill specific graduation requirements"
            ]
        },
        {
            "position": "IT intern",
            "company": "Monomoy Regional High School, Harwich, MA",
            "date": "January 2020",
            "key_parts_of_job": [
                "Hardware Repair",
                "Software Troubleshooting",
                "Google Workspace"
            ],
            "job_responsibilities": [
                "Maintained functioning computers for both students and facultyRepaired Computers(broken screens, broken laptops, battery replacements)",
                "Addressed issues and questions that students and faculty had"
            ]
        }
    ],
    "other_employment": [
        {
            "position": "Campus Ambassador",
            "company": "College for Social Innovation, Beverly, MA",
            "date": "January 2023 - May 2023",
            "responsibilities": [
                "Educate potential students on the benefits of taking part in the Semester in the City program"
            ]
        },
        {
            "position": "Closing Specialist",
            "company": "Chatham Candy Manor, Chatham, MA",
            "date": "May 2023 - Present",
            "responsibilities": [
                "Perform all responsibilities of a Retail Cashier Associate.",
                "Delegate closing cleaning and maintenance tasks.",
                "Handle money deposits at the bank and record transactions in internal books.",
                "Receive and inspect products from wholesale companies.",
                "Conduct elevated general repair and customer service tasks.",
                "Maintain effective communication with mail and upper management teams."
            ]
        },
        {
            "position": "Store Clerk",
            "company": "Chatham Candy Manor, Chatham, MA",
            "date": "March 2016 - May 2023",
            "responsibilities": [
                "Provide exceptional customer service and respond to inquiries.",
                "Process monetary transactions efficiently.",
                "Ensure quality assurance of products for sale.",
                "Train storefront staff for Candy Stockers and Retail Cashiers."
            ]
        },
        {
            "position": "Candy Stocker",
            "company": "Chatham Candy Manor, Chatham, MA",
            "date": "July 2016 - March 2017",
            "responsibilities": [
                "Regularly monitor candy inventory levels and replenish shelves to maintain a visually appealing and well-stocked display.",
                "Arrange candy products in an organized and attractive manner to enhance sales and ease customer browsing.",
                "Vigilantly check candy products for expiration dates, promptly removing any expired items from shelves to uphold product freshness and quality.",
                "Accurately price and label candy items, promptly updating price tags based on pricing changes."
            ]
        },
        {
            "position": "Laborer",
            "company": "Jodice Corporation, Chatham, MA",
            "date": "March 2014 - August 2021",
            "responsibilities": [
                "Efficiently retrieved tools and materials for construction tasks, including shingle installation, deck building, and demolition.",
                "Collaborated effectively with team members and prioritized safety compliance.",
                "Demonstrated meticulous attention to detail and upheld quality craftsmanship standards."
            ]
        }
    ]
}